## Pandas Serisi Oluşturmak

In [3]:
import pandas as pd

In [4]:
pd.Series([10,22,34,41,55])

0    10
1    22
2    34
3    41
4    55
dtype: int64

In [5]:
seri = pd.Series([10,22,34,41,55])

In [6]:
type(seri)

pandas.core.series.Series

In [7]:
seri.axes

[RangeIndex(start=0, stop=5, step=1)]

In [8]:
seri.dtype

dtype('int64')

In [9]:
seri.size

5

In [10]:
seri.ndim

1

In [11]:
seri.values

array([10, 22, 34, 41, 55], dtype=int64)

In [12]:
seri.head(3)

0    10
1    22
2    34
dtype: int64

In [14]:
seri.tail(3)

2    34
3    41
4    55
dtype: int64

## Index isimlendirmesi

In [15]:
pd.Series([99,22,332,94,5])

0     99
1     22
2    332
3     94
4      5
dtype: int64

In [16]:
pd.Series([99,22,332,94,5], index = [1,3,5,7,9])

1     99
3     22
5    332
7     94
9      5
dtype: int64

In [18]:
pd.Series([99,22,332,94,5], index = ["a","b","c","d","e"])

a     99
b     22
c    332
d     94
e      5
dtype: int64

In [19]:
seri = pd.Series([99,22,332,94,5], index = ["a","b","c","d","e"])

In [20]:
seri["a"]

99

In [21]:
seri["a":"c"]

a     99
b     22
c    332
dtype: int64

## Sozluk üzerinden liste oluşturmak

In [22]:
sozluk = {"reg":10, "log":11, "cart":12}

In [23]:
seri = pd.Series(sozluk)

In [24]:
seri

reg     10
log     11
cart    12
dtype: int64

## İki seriyi birleştirerek seri oluşturma

In [25]:
pd.concat([seri,seri])

reg     10
log     11
cart    12
reg     10
log     11
cart    12
dtype: int64

## Eleman İşlemleri

In [4]:
import numpy as np
a = np.array([1,2,33,444,75])
seri = pd.Series(a)
seri

0      1
1      2
2     33
3    444
4     75
dtype: int32

In [28]:
seri[0]

1

In [29]:
seri[0:3] #slice

0     1
1     2
2    33
dtype: int32

## Index işlemleri

In [30]:
seri = pd.Series([121,200,150,99], index = ["reg","loj","cart","rf"])

In [31]:
seri

reg     121
loj     200
cart    150
rf       99
dtype: int64

In [32]:
seri.index

Index(['reg', 'loj', 'cart', 'rf'], dtype='object')

In [33]:
seri.keys

<bound method Series.keys of reg     121
loj     200
cart    150
rf       99
dtype: int64>

In [34]:
list(seri.items())

[('reg', 121), ('loj', 200), ('cart', 150), ('rf', 99)]

In [35]:
seri.values

array([121, 200, 150,  99], dtype=int64)

## Eleman sorgulama

In [36]:
"reg" in seri

True

In [37]:
"a" in seri

False

## Fancy Index

In [38]:
seri[["rf","reg"]]

rf      99
reg    121
dtype: int64

In [39]:
seri["reg":"loj"]

reg    121
loj    200
dtype: int64

## Pandas DataFrame Oluşturma

Numpy fixed-type veri yapısına sahiptir. Bu yüzden içinde kategorik değişkenleri tutamıyor. İleri seviyedeki veri manipülasyonu işlemlerinde yetersiz kalıyor.

In [41]:
l = [1,2,39,67,90]
l

[1, 2, 39, 67, 90]

In [42]:
pd.DataFrame(l,columns = ["degisken_ismi"])

   degisken_ismi
0              1
1              2
2             39
3             67
4             90

In [43]:
#numpy imported as np
m = np.arange(1,10).reshape((3,3))
m

array([[1, 2, 3],
       [4, 5, 6],
       [7, 8, 9]])

In [44]:
pd.DataFrame(m,columns = ["var1","var2","var3"])

   var1  var2  var3
0     1     2     3
1     4     5     6
2     7     8     9

## DataFrame isimlendirme

In [47]:
df =pd.DataFrame(m,columns = ["var1","var2","var3"])
df.head()

   var1  var2  var3
0     1     2     3
1     4     5     6
2     7     8     9

In [48]:
df.columns = ("deg1","deg2","deg3")
df

   deg1  deg2  deg3
0     1     2     3
1     4     5     6
2     7     8     9

In [49]:
type(df)

pandas.core.frame.DataFrame

In [50]:
df.axes

[RangeIndex(start=0, stop=3, step=1),
 Index(['deg1', 'deg2', 'deg3'], dtype='object')]

In [51]:
df.shape

(3, 3)

In [52]:
df.ndim

2

In [53]:
df.size

9

In [54]:
df.values

array([[1, 2, 3],
       [4, 5, 6],
       [7, 8, 9]])

In [55]:
type(df.values)

numpy.ndarray

Yukarıda görüldüğü üzere **df.values** yazıldıktan sonra df verileri tek tek çekilip numpy listesine aktarılıyor ve öyle çıktı döndürülüyor. **type(df.values)** yazıldığı zaman da numpy.ndarray tipinde olduğu görülüyor.

In [58]:
df.head(1)

   deg1  deg2  deg3
0     1     2     3

In [59]:
df.tail(1)

   deg1  deg2  deg3
2     7     8     9

In [60]:
a = np.array([1,2,3,4,5])

In [61]:
pd.DataFrame(a,columns=["deg1"])

   deg1
0     1
1     2
2     3
3     4
4     5

## Pandas DataFrame eleman işlemleri

In [63]:
s1 = np.random.randint(10,size=5)
s2 = np.random.randint(10,size=5)
s3 = np.random.randint(10,size=5)

In [64]:
sozluk = {"var1":s1,"var2":s2,"var3":s3}
sozluk

{'var1': array([1, 6, 7, 9, 9]),
 'var2': array([0, 7, 4, 4, 4]),
 'var3': array([5, 8, 9, 0, 9])}

In [81]:
df = pd.DataFrame(sozluk)
df

   var1  var2  var3
0     1     0     5
1     6     7     8
2     7     4     9
3     9     4     0
4     9     4     9

In [68]:
df[0:1]

   var1  var2  var3
0     1     0     5

In [83]:
df.index = ["a","b","c","d","e"]
df

   var1  var2  var3
a     1     0     5
b     6     7     8
c     7     4     9
d     9     4     0
e     9     4     9

In [76]:
df["c":"e"]

   var1  var2  var3
c     7     4     9
d     9     4     0
e     9     4     9

## Eleman Silme

In [84]:
df.drop("a",axis=0)

   var1  var2  var3
b     6     7     8
c     7     4     9
d     9     4     0
e     9     4     9

In [85]:
df

   var1  var2  var3
a     1     0     5
b     6     7     8
c     7     4     9
d     9     4     0
e     9     4     9

In [86]:
df.drop("a",axis=0,inplace=True)
df

   var1  var2  var3
b     6     7     8
c     7     4     9
d     9     4     0
e     9     4     9

**drop()** metodunun **inplace** argümanını **True** yapmadan yapılan silme işlemi kalıcı olmaz.

## Fancy ile silme

In [87]:
l = ["c","e"]

In [88]:
df.drop(l,axis=0)

   var1  var2  var3
b     6     7     8
d     9     4     0

In [89]:
##degiskenler icin

In [90]:
l = ["var1","var4","var2"]

In [91]:
for i in l:
    print(i in df)

True
False
True

In [92]:
df

   var1  var2  var3
b     6     7     8
c     7     4     9
d     9     4     0
e     9     4     9

In [93]:
df["var4"] = df["var1"] * df["var2"]
df

   var1  var2  var3  var4
b     6     7     8    42
c     7     4     9    28
d     9     4     0    36
e     9     4     9    36

In [96]:
df.drop("var4",axis=1,inplace=True)

In [97]:
df

   var1  var2  var3
b     6     7     8
c     7     4     9
d     9     4     0
e     9     4     9

In [98]:
l = ["var1","var2"]
df.drop(l,axis=1)

   var3
b     8
c     9
d     0
e     9

## Gözlem ve Değişken Seçimi

In [99]:
m = np.random.randint(1,30,size=(10,3))
df = pd.DataFrame(m,columns=["var1","var2","var3"])
df

   var1  var2  var3
0    11    10    10
1    28    16    14
2    27     5    14
3    13     7    19
4    22     9    16
5     7    13    27
6    21    22     6
7     3    27     8
8    18     1    28
9    20     1    26

**loc:** Tanımlandığı şekli ile seçim yapmak için kullanılır.

In [101]:
df.loc[0:3]

   var1  var2  var3
0    11    10    10
1    28    16    14
2    27     5    14
3    13     7    19

**iloc:** Alışık olduğumuz indeksleme mantığı ile seçim yapar.

In [102]:
df.iloc[0:3]

   var1  var2  var3
0    11    10    10
1    28    16    14
2    27     5    14

In [103]:
df.iloc[0,0]

11

In [104]:
df.iloc[:3,:2]

   var1  var2
0    11    10
1    28    16
2    27     5

In [105]:
df.loc[0:3,"var3"]

0    10
1    14
2    14
3    19
Name: var3, dtype: int32

In [106]:
df.iloc[0:3]["var3"]

0    10
1    14
2    14
Name: var3, dtype: int32

## Koşullu Eleman İşlemleri

In [109]:
df[df.var1 > 15]

   var1  var2  var3
1    28    16    14
2    27     5    14
4    22     9    16
6    21    22     6
8    18     1    28
9    20     1    26

In [111]:
df[(df.var1>15)&(df.var3<20)]

   var1  var2  var3
1    28    16    14
2    27     5    14
4    22     9    16
6    21    22     6

In [112]:
df.loc[(df.var1 > 15), ["var1","var2"]]

   var1  var2
1    28    16
2    27     5
4    22     9
6    21    22
8    18     1
9    20     1

In [113]:
df[(df.var1 > 15)][["var1","var2"]]

   var1  var2
1    28    16
2    27     5
4    22     9
6    21    22
8    18     1
9    20     1

## Birleştirme(Join) işlemleri

In [5]:
m = np.random.randint(1,30,size=(5,3))
df1 = pd.DataFrame(m,columns=["var1","var2","var3"])
df1

   var1  var2  var3
0    20    22     2
1    17     2     5
2     9    12    18
3     4    23     2
4    12     1     3

In [6]:
df2 = df1 + 34
df2

   var1  var2  var3
0    54    56    36
1    51    36    39
2    43    46    52
3    38    57    36
4    46    35    37

In [7]:
pd.concat([df1,df2])

   var1  var2  var3
0    20    22     2
1    17     2     5
2     9    12    18
3     4    23     2
4    12     1     3
0    54    56    36
1    51    36    39
2    43    46    52
3    38    57    36
4    46    35    37

In [8]:
pd.concat([df1,df2],ignore_index=True)

   var1  var2  var3
0    20    22     2
1    17     2     5
2     9    12    18
3     4    23     2
4    12     1     3
5    54    56    36
6    51    36    39
7    43    46    52
8    38    57    36
9    46    35    37

In [9]:
df1.columns

Index(['var1', 'var2', 'var3'], dtype='object')

In [10]:
df2.columns = ["var1","var2","deg3"]

In [11]:
df2

   var1  var2  deg3
0    54    56    36
1    51    36    39
2    43    46    52
3    38    57    36
4    46    35    37

In [12]:
pd.concat([df1,df2],join="inner")

   var1  var2
0    20    22
1    17     2
2     9    12
3     4    23
4    12     1
0    54    56
1    51    36
2    43    46
3    38    57
4    46    35

**var3** ve **deg3** sütunları ortak olmadığından birleştirme işlemi hatalı ve mantıksız olacaktır. Bu tip durumlarda **join='inner'** parametresiyle ortak olan sütunları alarak birleştirme işlemi yapılır.

## İleri Birleştirme İşlemleri

In [34]:
df1 = pd.DataFrame({'calisanlar':['Ali','Veli','Ayse','Fatma'],
                    'grup': ['Muhasebe','Muhendislik','Muhendislik','İK']
                   })
df1

  calisanlar         grup
0        Ali     Muhasebe
1       Veli  Muhendislik
2       Ayse  Muhendislik
3      Fatma           İK

In [35]:
df2 = pd.DataFrame({'calisanlar': ['Ayse','Ali','Veli','Fatma'],
                    'ilk_giris': [2010,2009,2014,2019]
                   })
df2

  calisanlar  ilk_giris
0       Ayse       2010
1        Ali       2009
2       Veli       2014
3      Fatma       2019

In [36]:
pd.merge(df1,df2)

  calisanlar         grup  ilk_giris
0        Ali     Muhasebe       2009
1       Veli  Muhendislik       2014
2       Ayse  Muhendislik       2010
3      Fatma           İK       2019

In [37]:
pd.merge(df1,df2,on="calisanlar")

  calisanlar         grup  ilk_giris
0        Ali     Muhasebe       2009
1       Veli  Muhendislik       2014
2       Ayse  Muhendislik       2010
3      Fatma           İK       2019

## Many to One

In [38]:
df3 = pd.merge(df1,df2)
df3

  calisanlar         grup  ilk_giris
0        Ali     Muhasebe       2009
1       Veli  Muhendislik       2014
2       Ayse  Muhendislik       2010
3      Fatma           İK       2019

In [39]:
df4 = pd.DataFrame({'grup': ['Muhasebe','Muhendislik','İK'],
                    'mudur': ['Caner','Mustafa','Berkcan']
                   })
df4

          grup    mudur
0     Muhasebe    Caner
1  Muhendislik  Mustafa
2           İK  Berkcan

In [40]:
pd.merge(df3,df4)

  calisanlar         grup  ilk_giris    mudur
0        Ali     Muhasebe       2009    Caner
1       Veli  Muhendislik       2014  Mustafa
2       Ayse  Muhendislik       2010  Mustafa
3      Fatma           İK       2019  Berkcan

## Many To Many

In [41]:
df5 = pd.DataFrame({'grup': ['Muhasebe','Muhasebe','Muhendislik','Muhendislik','İK','İK'],
                    'yetenekler': ['matematik','excel','kodlama','linux','excel','yonetim']
                   })
df5

          grup yetenekler
0     Muhasebe  matematik
1     Muhasebe      excel
2  Muhendislik    kodlama
3  Muhendislik      linux
4           İK      excel
5           İK    yonetim

In [42]:
df1

  calisanlar         grup
0        Ali     Muhasebe
1       Veli  Muhendislik
2       Ayse  Muhendislik
3      Fatma           İK

In [43]:
pd.merge(df1,df5)

  calisanlar         grup yetenekler
0        Ali     Muhasebe  matematik
1        Ali     Muhasebe      excel
2       Veli  Muhendislik    kodlama
3       Veli  Muhendislik      linux
4       Ayse  Muhendislik    kodlama
5       Ayse  Muhendislik      linux
6      Fatma           İK      excel
7      Fatma           İK    yonetim

## Toplulaştırma ve Gruplama

Basit toplulaştırma fonsiyonları:
* count()
* first()
* last()
* mean()
* median()
* min()
* max()
* std()
* var()
* sum()

In [45]:
import seaborn as sns

In [46]:
df = sns.load_dataset("planets")
df

               method  number  orbital_period   mass  distance  year
0     Radial Velocity       1      269.300000   7.10     77.40  2006
1     Radial Velocity       1      874.774000   2.21     56.95  2008
2     Radial Velocity       1      763.000000   2.60     19.84  2011
3     Radial Velocity       1      326.030000  19.40    110.62  2007
4     Radial Velocity       1      516.220000  10.50    119.47  2009
...               ...     ...             ...    ...       ...   ...
1030          Transit       1        3.941507    NaN    172.00  2006
1031          Transit       1        2.615864    NaN    148.00  2007
1032          Transit       1        3.191524    NaN    174.00  2007
1033          Transit       1        4.125083    NaN    293.00  2008
1034          Transit       1        4.187757    NaN    260.00  2008

[1035 rows x 6 columns]

In [47]:
df.head()

            method  number  orbital_period   mass  distance  year
0  Radial Velocity       1         269.300   7.10     77.40  2006
1  Radial Velocity       1         874.774   2.21     56.95  2008
2  Radial Velocity       1         763.000   2.60     19.84  2011
3  Radial Velocity       1         326.030  19.40    110.62  2007
4  Radial Velocity       1         516.220  10.50    119.47  2009

In [48]:
df.shape

(1035, 6)

In [49]:
df.mean()

number               1.785507
orbital_period    2002.917596
mass                 2.638161
distance           264.069282
year              2009.070531
dtype: float64

In [50]:
df["mass"].mean()

2.6381605847953233

In [51]:
df["mass"].count()

513

In [52]:
df["mass"].min()

0.0036

In [53]:
df["mass"].max()

25.0

In [54]:
df["mass"].sum()

1353.37638

In [55]:
df["mass"].std()

3.8186166509616046

In [56]:
df["mass"].var()

14.58183312700122

In [58]:
df.describe().T

,count,mean,std,min,25%,50%,75%,max
number,1035.0,1.785507,1.240976,1.000000,1.00000,1.0000,2.000,7.0
orbital_period,992.0,2002.917596,26014.728304,0.090706,5.44254,39.9795,526.005,730000.0
mass,513.0,2.638161,3.818617,0.003600,0.22900,1.2600,3.040,25.0
distance,808.0,264.069282,733.116493,1.350000,32.56000,55.2500,178.500,8500.0
year,1035.0,2009.070531,3.972567,1989.000000,2007.00000,2010.0000,2012.000,2014.0

In [59]:
df.dropna().describe().T

,count,mean,std,min,25%,50%,75%,max
number,498.0,1.734940,1.175720,1.0000,1.00000,1.000,2.0000,6.0
orbital_period,498.0,835.778671,1469.128259,1.3283,38.27225,357.000,999.6000,17337.5
mass,498.0,2.509320,3.636274,0.0036,0.21250,1.245,2.8675,25.0
distance,498.0,52.068213,46.596041,1.3500,24.49750,39.940,59.3325,354.0
year,498.0,2007.377510,4.167284,1989.0000,2005.00000,2009.000,2011.0000,2014.0

## Gruplama İşlemleri

In [65]:
df = pd.DataFrame({'gruplar': ['A','B','C','A','B','C'],'veri': [10,11,52,23,43,55]}, columns=['gruplar','veri'])
df

  gruplar  veri
0       A    10
1       B    11
2       C    52
3       A    23
4       B    43
5       C    55

In [66]:
df.groupby("gruplar")

In [67]:
df.groupby("gruplar").mean()

         veri
gruplar
A        16.5
B        27.0
C        53.5

In [68]:
df.groupby("gruplar").sum()

         veri
gruplar
A          33
B          54
C         107

In [69]:
df = sns.load_dataset("planets")
df.head()

            method  number  orbital_period   mass  distance  year
0  Radial Velocity       1         269.300   7.10     77.40  2006
1  Radial Velocity       1         874.774   2.21     56.95  2008
2  Radial Velocity       1         763.000   2.60     19.84  2011
3  Radial Velocity       1         326.030  19.40    110.62  2007
4  Radial Velocity       1         516.220  10.50    119.47  2009

In [70]:
df.groupby("method")

In [71]:
df.groupby("method")["orbital_period"].mean()

method
Astrometry                          631.180000
Eclipse Timing Variations          4751.644444
Imaging                          118247.737500
Microlensing                       3153.571429
Orbital Brightness Modulation         0.709307
Pulsar Timing                      7343.021201
Pulsation Timing Variations        1170.000000
Radial Velocity                     823.354680
Transit                              21.102073
Transit Timing Variations            79.783500
Name: orbital_period, dtype: float64

In [72]:
df.groupby("method")["mass"].mean()

method
Astrometry                            NaN
Eclipse Timing Variations        5.125000
Imaging                               NaN
Microlensing                          NaN
Orbital Brightness Modulation         NaN
Pulsar Timing                         NaN
Pulsation Timing Variations           NaN
Radial Velocity                  2.630699
Transit                          1.470000
Transit Timing Variations             NaN
Name: mass, dtype: float64

In [73]:
df.groupby("method")["orbital_period"].describe()

,count,mean,std,min,25%,50%,75%,max
method,,,,,,,,
Astrometry,2.0,631.180000,544.217663,246.360000,438.770000,631.180000,823.590000,1016.000000
Eclipse Timing Variations,9.0,4751.644444,2499.130945,1916.250000,2900.000000,4343.500000,5767.000000,10220.000000
Imaging,12.0,118247.737500,213978.177277,4639.150000,8343.900000,27500.000000,94250.000000,730000.000000
Microlensing,7.0,3153.571429,1113.166333,1825.000000,2375.000000,3300.000000,3550.000000,5100.000000
Orbital Brightness Modulation,3.0,0.709307,0.725493,0.240104,0.291496,0.342887,0.943908,1.544929
Pulsar Timing,5.0,7343.021201,16313.265573,0.090706,25.262000,66.541900,98.211400,36525.000000
Pulsation Timing Variations,1.0,1170.000000,NaN,1170.000000,1170.000000,1170.000000,1170.000000,1170.000000
Radial Velocity,553.0,823.354680,1454.926210,0.736540,38.021000,360.200000,982.000000,17337.500000
Transit,397.0,21.102073,46.185893,0.355000,3.160630,5.714932,16.145700,331.600590
Transit Timing Variations,3.0,79.783500,71.599884,22.339500,39.675250,57.011000,108.505500,160.000000

## İleri Toplulaştırma işlemleri(Aggregate,filter,transform,apply)

In [74]:
df = pd.DataFrame({'gruplar': ['A','B','C','A','B','C'],
                   'degisken1': [10,23,33,22,11,99],
                    'degisken2': [100,253,333,262,111,969]},
                   columns = ['gruplar','degisken1','degisken2'])
df

  gruplar  degisken1  degisken2
0       A         10        100
1       B         23        253
2       C         33        333
3       A         22        262
4       B         11        111
5       C         99        969

In [75]:
#aggregate

In [76]:
df.groupby("gruplar").mean()

         degisken1  degisken2
gruplar
A               16        181
B               17        182
C               66        651

In [78]:
df.groupby("gruplar").aggregate([min,np.median,max])

        degisken1            degisken2
              min median max       min median  max
gruplar
A              10     16  22       100    181  262
B              11     17  23       111    182  253
C              33     66  99       333    651  969

In [79]:
df.groupby("gruplar").aggregate({"degisken1":"min","degisken2":"max"})

         degisken1  degisken2
gruplar
A               10        262
B               11        253
C               33        969

In [80]:
# filter

In [84]:
def filter_func(x):
    return x["degisken1"].std() > 9

In [85]:
df.groupby("gruplar").filter(filter_func)

  gruplar  degisken1  degisken2
2       C         33        333
5       C         99        969

In [86]:
# transform

In [88]:
df["degisken1"]*9

0     90
1    207
2    297
3    198
4     99
5    891
Name: degisken1, dtype: int64

In [89]:
df_a = df.iloc[:,1:3]

In [92]:
df_a.transform(lambda x: (x-x.mean())/x.std())

   degisken1  degisken2
0  -0.687871  -0.738461
1  -0.299074  -0.263736
2   0.000000  -0.015514
3  -0.328982  -0.235811
4  -0.657963  -0.704331
5   1.973890   1.957853

In [93]:
# apply

In [98]:
df = pd.DataFrame({'gruplar': ['A','B','C','A','B','C'],
                   'degisken1': [10,23,33,22,11,99],
                    'degisken2': [100,253,333,262,111,969]},
                   columns = ['gruplar','degisken1','degisken2'])
df

  gruplar  degisken1  degisken2
0       A         10        100
1       B         23        253
2       C         33        333
3       A         22        262
4       B         11        111
5       C         99        969

In [99]:
df.apply(np.sum)

gruplar      ABCABC
degisken1       198
degisken2      2028
dtype: object

In [103]:
df.iloc[:,1:3].apply(np.mean)

degisken1     33.0
degisken2    338.0
dtype: float64

In [104]:
df.groupby("gruplar").apply(np.sum)

        gruplar  degisken1  degisken2
gruplar
A            AA         32        362
B            BB         34        364
C            CC        132       1302

## Pivot Tablolar

In [105]:
#seaborn imported as sns
titanic=sns.load_dataset('titanic')
titanic.head()

,survived,pclass,sex,age,sibsp,parch,fare,embarked,class,who,adult_male,deck,embark_town,alive,alone
0,0,3,male,22.0,1,0,7.2500,S,Third,man,True,NaN,Southampton,no,False
1,1,1,female,38.0,1,0,71.2833,C,First,woman,False,C,Cherbourg,yes,False
2,1,3,female,26.0,0,0,7.9250,S,Third,woman,False,NaN,Southampton,yes,True
3,1,1,female,35.0,1,0,53.1000,S,First,woman,False,C,Southampton,yes,False
4,0,3,male,35.0,0,0,8.0500,S,Third,man,True,NaN,Southampton,no,True

In [112]:
titanic.groupby("sex")[["survived"]].mean()

        survived
sex
female  0.742038
male    0.188908

In [113]:
titanic.groupby(["sex","class"])[["survived"]].aggregate("mean").unstack()

        survived
class      First    Second     Third
sex
female  0.968085  0.921053  0.500000
male    0.368852  0.157407  0.135447

In [114]:
#pivot ile table

In [115]:
titanic.pivot_table("survived",index="sex",columns="class")

class      First    Second     Third
sex
female  0.968085  0.921053  0.500000
male    0.368852  0.157407  0.135447

In [118]:
titanic.age.head(10)

0    22.0
1    38.0
2    26.0
3    35.0
4    35.0
5     NaN
6    54.0
7     2.0
8    27.0
9    14.0
Name: age, dtype: float64

In [117]:
age = pd.cut(titanic["age"],[0,18,90])
age.head(10)

0    (18.0, 90.0]
1    (18.0, 90.0]
2    (18.0, 90.0]
3    (18.0, 90.0]
4    (18.0, 90.0]
5             NaN
6    (18.0, 90.0]
7     (0.0, 18.0]
8    (18.0, 90.0]
9     (0.0, 18.0]
Name: age, dtype: category
Categories (2, interval[int64]): [(0, 18] < (18, 90]]

In [119]:
titanic.pivot_table("survived",["sex",age],"class")

class               First    Second     Third
sex    age
female (0, 18]   0.909091  1.000000  0.511628
       (18, 90]  0.972973  0.900000  0.423729
male   (0, 18]   0.800000  0.600000  0.215686
       (18, 90]  0.375000  0.071429  0.133663

## Dış Kaynaklı Veri Okumak

## CSV Okuma

In [121]:
pd.read_csv("reading_data/ornekcsv.csv",sep=";")

      a    b     c
0    78   12   1.0
1    78   12   2.0
2    78  324   3.0
3     7    2   4.0
4    88   23   5.0
5     6    2   NaN
6    56   11   6.0
7     7   12   7.0
8    56   21   7.0
9   346    2   8.0
10    5    1   8.0
11  456   21   8.0
12    3   12  88.0

## Txt okuma

In [122]:
pd.read_csv("reading_data/duz_metin.txt")

    1 2
0   2 2
1   3 2
2   4 2
3   5 2
4   6 2
5  7 2
6   8 2
7   9 2
8  10 2

## Excel Okuma

In [124]:
df = pd.read_excel("reading_data/ornekx.xlsx")
df

      a    b     c
0    78   12   1.0
1    78   12   2.0
2    78  324   3.0
3     7    2   4.0
4    88   23   5.0
5     6    2   NaN
6    56   11   6.0
7     7   12   7.0
8    56   21   7.0
9   346    2   8.0
10    5    1   8.0
11  456   21   8.0
12    3   12  88.0

In [125]:
df.head()

    a    b    c
0  78   12  1.0
1  78   12  2.0
2  78  324  3.0
3   7    2  4.0
4  88   23  5.0

In [132]:
df.columns = ("A","B","C")

In [133]:
df

      A    B     C
0    78   12   1.0
1    78   12   2.0
2    78  324   3.0
3     7    2   4.0
4    88   23   5.0
5     6    2   NaN
6    56   11   6.0
7     7   12   7.0
8    56   21   7.0
9   346    2   8.0
10    5    1   8.0
11  456   21   8.0
12    3   12  88.0